Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/adc.h
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC4_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC4_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC4_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC4_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC4_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC4_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC4_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC4_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC4_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC4_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC4_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER0       (ADC_CHNCFG4_TRGSRC4_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER1       (ADC_CHNCFG4_TRGSRC4_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER2       (ADC_CHNCFG4_TRGSRC4_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER3       (ADC_CHNCFG4_TRGSRC4_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER4       (ADC_CHNCFG4_TRGSRC4_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER5       (ADC_CHNCFG4_TRGSRC4_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER6       (ADC_CHNCFG4_TRGSRC4_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER7       (ADC_CHNCFG4_TRGSRC4_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER8       (ADC_CHNCFG4_TRGSRC4_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER9       (ADC_CHNCFG4_TRGSRC4_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC4_EVENT_USER10      (ADC_CHNCFG4_TRGSRC4_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC4_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_TRGSRC5_Pos               _UINT32_(20)                                         /* (ADC_CHNCFG4) Channel 5 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC5_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC5_Pos)           /* (ADC_CHNCFG4) Channel 5 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC5(value)            (ADC_CHNCFG4_TRGSRC5_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC5_Pos)) /* Assigment of value for TRGSRC5 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC5_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC5_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC5_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC5_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC5_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC5_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC5_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC5_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC5_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC5_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC5_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC5_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC5_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC5_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC5_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC5_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER0       (ADC_CHNCFG4_TRGSRC5_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER1       (ADC_CHNCFG4_TRGSRC5_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER2       (ADC_CHNCFG4_TRGSRC5_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER3       (ADC_CHNCFG4_TRGSRC5_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER4       (ADC_CHNCFG4_TRGSRC5_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER5       (ADC_CHNCFG4_TRGSRC5_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER6       (ADC_CHNCFG4_TRGSRC5_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER7       (ADC_CHNCFG4_TRGSRC5_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER8       (ADC_CHNCFG4_TRGSRC5_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER9       (ADC_CHNCFG4_TRGSRC5_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC5_EVENT_USER10      (ADC_CHNCFG4_TRGSRC5_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC5_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_TRGSRC6_Pos               _UINT32_(24)                                         /* (ADC_CHNCFG4) Channel 6 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC6_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC6_Pos)           /* (ADC_CHNCFG4) Channel 6 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC6(value)            (ADC_CHNCFG4_TRGSRC6_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC6_Pos)) /* Assigment of value for TRGSRC6 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC6_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC6_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC6_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC6_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC6_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC6_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC6_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC6_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC6_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC6_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC6_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC6_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC6_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC6_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC6_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC6_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER0       (ADC_CHNCFG4_TRGSRC6_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER1       (ADC_CHNCFG4_TRGSRC6_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER2       (ADC_CHNCFG4_TRGSRC6_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER3       (ADC_CHNCFG4_TRGSRC6_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER4       (ADC_CHNCFG4_TRGSRC6_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER5       (ADC_CHNCFG4_TRGSRC6_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER6       (ADC_CHNCFG4_TRGSRC6_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER7       (ADC_CHNCFG4_TRGSRC6_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER8       (ADC_CHNCFG4_TRGSRC6_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER9       (ADC_CHNCFG4_TRGSRC6_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC6_EVENT_USER10      (ADC_CHNCFG4_TRGSRC6_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC6_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_TRGSRC7_Pos               _UINT32_(28)                                         /* (ADC_CHNCFG4) Channel 7 Trigger Source Position */
#define ADC_CHNCFG4_TRGSRC7_Msk               (_UINT32_(0xF) << ADC_CHNCFG4_TRGSRC7_Pos)           /* (ADC_CHNCFG4) Channel 7 Trigger Source Mask */
#define ADC_CHNCFG4_TRGSRC7(value)            (ADC_CHNCFG4_TRGSRC7_Msk & (_UINT32_(value) << ADC_CHNCFG4_TRGSRC7_Pos)) /* Assigment of value for TRGSRC7 in the ADC_CHNCFG4 register */
#define   ADC_CHNCFG4_TRGSRC7_NO_TRIGGER_Val  _UINT32_(0x0)                                        /* (ADC_CHNCFG4) No Trigger (NOP)  */
#define   ADC_CHNCFG4_TRGSRC7_GLOBAL_SOFTWARE_TRIGGER_Val _UINT32_(0x1)                                        /* (ADC_CHNCFG4) Global Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC7_GLOBAL_LEVEL_TRIGGER_Val _UINT32_(0x2)                                        /* (ADC_CHNCFG4) Global Level Software Trigger  */
#define   ADC_CHNCFG4_TRGSRC7_SCAN_TRIGGER_Val _UINT32_(0x3)                                        /* (ADC_CHNCFG4) SCANTRG - Scan Trigger  */
#define   ADC_CHNCFG4_TRGSRC7_SYNC_TRIGGER_Val _UINT32_(0x4)                                        /* (ADC_CHNCFG4) STRIG Synchronous Trigger  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER0_Val _UINT32_(0x5)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 0  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER1_Val _UINT32_(0x6)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 1  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER2_Val _UINT32_(0x7)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 2  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER3_Val _UINT32_(0x8)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 3  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER4_Val _UINT32_(0x9)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 4  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER5_Val _UINT32_(0xA)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 5  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER6_Val _UINT32_(0xB)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 6  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER7_Val _UINT32_(0xC)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 7  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER8_Val _UINT32_(0xD)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 8  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER9_Val _UINT32_(0xE)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 9  */
#define   ADC_CHNCFG4_TRGSRC7_EVENT_USER10_Val _UINT32_(0xF)                                        /* (ADC_CHNCFG4) ADC Trigger Event User 10  */
#define ADC_CHNCFG4_TRGSRC7_NO_TRIGGER        (ADC_CHNCFG4_TRGSRC7_NO_TRIGGER_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) No Trigger (NOP) Position  */
#define ADC_CHNCFG4_TRGSRC7_GLOBAL_SOFTWARE_TRIGGER (ADC_CHNCFG4_TRGSRC7_GLOBAL_SOFTWARE_TRIGGER_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) Global Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC7_GLOBAL_LEVEL_TRIGGER (ADC_CHNCFG4_TRGSRC7_GLOBAL_LEVEL_TRIGGER_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) Global Level Software Trigger Position  */
#define ADC_CHNCFG4_TRGSRC7_SCAN_TRIGGER      (ADC_CHNCFG4_TRGSRC7_SCAN_TRIGGER_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) SCANTRG - Scan Trigger Position  */
#define ADC_CHNCFG4_TRGSRC7_SYNC_TRIGGER      (ADC_CHNCFG4_TRGSRC7_SYNC_TRIGGER_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) STRIG Synchronous Trigger Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER0       (ADC_CHNCFG4_TRGSRC7_EVENT_USER0_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 0 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER1       (ADC_CHNCFG4_TRGSRC7_EVENT_USER1_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 1 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER2       (ADC_CHNCFG4_TRGSRC7_EVENT_USER2_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 2 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER3       (ADC_CHNCFG4_TRGSRC7_EVENT_USER3_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 3 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER4       (ADC_CHNCFG4_TRGSRC7_EVENT_USER4_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 4 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER5       (ADC_CHNCFG4_TRGSRC7_EVENT_USER5_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 5 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER6       (ADC_CHNCFG4_TRGSRC7_EVENT_USER6_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 6 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER7       (ADC_CHNCFG4_TRGSRC7_EVENT_USER7_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 7 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER8       (ADC_CHNCFG4_TRGSRC7_EVENT_USER8_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 8 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER9       (ADC_CHNCFG4_TRGSRC7_EVENT_USER9_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 9 Position  */
#define ADC_CHNCFG4_TRGSRC7_EVENT_USER10      (ADC_CHNCFG4_TRGSRC7_EVENT_USER10_Val << ADC_CHNCFG4_TRGSRC7_Pos) /* (ADC_CHNCFG4) ADC Trigger Event User 10 Position  */
#define ADC_CHNCFG4_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ADC_CHNCFG4) Register Mask  */


/* -------- ADC_CHNCFG5 : (ADC Offset: 0x14) (R/W 32) Channel Configuration 5 (TRGSRC) -------- */
#define ADC_CHNCFG5_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_CHNCFG5) Channel Configuration 5 (TRGSRC)  Reset Value */

